[
  {
    "id": "dest_001",
    "name": "Pokhara",
    "slug": "pokhara-nepal",
    "country": "Nepal",
    "continent": "Asia",
    "image_url": "https://images.unsplash.com/photo-1582692119782-7c891b3c489a?w=1200&q=80",
    "blog": "## Serenity and Adventure in Pokhara, Nepal\n\nPokhara is a metropolitan city in Nepal, serving as the capital of Gandaki Province. It is the country's largest metropolitan city in terms of area and second-largest in terms of population. The city also serves as the headquarters of Kaski District. Pokhara is located 200 kilometres (120 miles) west of the capital, Kathmandu. The altitude varies from 827 metres (2,713 feet) in the southern part to 1,740 metres (5,710 feet) in the north. The Annapurna Range, with three of the ten highest mountains in the world — Dhaulagiri, Annapurna I and Manaslu — is within 15–35 mi (24–56 km) of the valley.",
    "highlights": [
      "Phewa Lake",
      "Annapurna View",
      "Paragliding",
      "Peace Pagoda",
      "Begnas Lake",
      "Gupteshwor Cave",
      "Bindhyabasini Temple"
    ],
    "quick_fact": "Known as the Jewel of the Himalayas, Pokhara offers a perfect blend of natural beauty, adventure activities, and cultural experiences.",
    "coordinates": {
      "lat": 28.2096,
      "lng": 83.9856
    },
    "best_season": "September to November for clear skies and moderate temperatures",
    "budget_tier": "mid-range",
    "local_tips": [
      "Take a sunrise boat ride on Phewa Lake for breathtaking views of the Annapurna Range",
      "Visit the International Mountain Museum to learn about the history and culture of the Himalayas",
      "Try local Nepali cuisine at Lakeside restaurants for an authentic taste of the region",
      "Explore the nearby Sarangkot hill for panoramic views of the sunrise over the Himalayas",
      "Attend the annual Pokhara Street Festival in December for a vibrant cultural experience"
    ],
    "description": "Pokhara, a picturesque city in Nepal, is renowned for its stunning lakes, majestic mountain views, and vibrant culture. It serves as the perfect gateway to the Himalayas, offering a wide range of activities for nature lovers and adventure enthusiasts. Whether you seek tranquility by the lakeside or thrill through paragliding and trekking, Pokhara has something for everyone. With a backdrop of the Annapurna mountain range, this charming city is a must-visit destination for those seeking a blend of natural beauty and outdoor adventures.",
    "estimated_budget": 899,
    "price_range": {
      "min": 899,
      "max": 1199
    },
    "rating": 4.8,
    "review_count": 870
  },
  {
    "id": "dest_002",
    "name": "Kathmandu",
    "slug": "kathmandu-nepal",
    "country": "Nepal",
    "continent": "Asia",
    "image_url": "https://images.unsplash.com/photo-1596150683813-3984b33a9d63?w=1200&q=80",
    "blog": "## The Heart of Nepal: Kathmandu\n\nKathmandu, the capital of Nepal, is a city where ancient traditions are zealously guarded while at the same time embracing modern technology. The city is a treasure trove of ancient art and culture, with its narrow lanes, bustling markets, and ornate temples. From the moment you arrive, you will be captivated by the city's energy and charm. The city is home to seven UNESCO World Heritage Sites, including the Pashupatinath Temple, the Swayambhunath Stupa, and the Boudhanath Stupa.",
    "highlights": [
      "Swayambhunath Temple",
      "Durbar Square",
      "Boudhanath Stupa",
      "Thamel Market",
      "Pashupatinath Temple",
      "Garden of Dreams",
      "Kathmandu Durbar Square"
    ],
    "quick_fact": "Kathmandu, the vibrant capital city of Nepal, is a melting pot of Hindu and Buddhist cultures, offering a unique blend of ancient traditions and modern influences.",
    "coordinates": {
      "lat": 27.7172,
      "lng": 85.324
    },
    "best_season": "The best time to visit Kathmandu is during the spring months of March to May and the autumn months of September to November when the weather is pleasant and ideal for sightseeing.",
    "budget_tier": "mid-range",
    "local_tips": [
      "Try traditional Nepali cuisine like momos and dal bhat",
      "Bargain while shopping in Thamel Market for souvenirs",
      "Respect local customs and traditions when visiting temples and religious sites"
    ],
    "description": "Kathmandu, the capital city of Nepal, is a bustling metropolis that serves as the country's cultural and historical heart. From ancient temples and stupas to vibrant markets and bustling streets, Kathmandu offers visitors a glimpse into the rich tapestry of Nepalese life. The city's unique blend of Hindu and Buddhist heritage is evident in its numerous sacred sites, including the iconic Swayambhunath Temple and the revered Pashupatinath Temple. Explore the narrow alleyways of Thamel Market for handicrafts and local goods, or marvel at the stunning architecture of Kathmandu Durbar Square. Whether you're seeking spiritual enlightenment, outdoor adventures, or simply a taste of authentic Nepalese culture, Kathmandu has something for every traveler.",
    "estimated_budget": 999,
    "price_range": {
      "min": 999,
      "max": 1299
    },
    "rating": 4.7,
    "review_count": 1176
  },
  {
    "id": "dest_003",
    "name": "Chitwan National Park",
    "slug": "chitwan-national-park-nepal",
    "country": "Nepal",
    "continent": "Asia",
    "image_url": "https://images.unsplash.com/photo-1583899206887-b580f1b81543?w=1200&q=80",
    "blog": "## A Wildlife Haven: Chitwan National Park\n\nChitwan National Park is the first national park in Nepal. It was established in 1973 and granted the status of a World Heritage Site in 1984. It covers an area of 952.63 km2 (367.81 sq mi) and is located in the subtropical Inner Terai lowlands of south-central Nepal in the districts of Nawalpur, Parsa, Chitwan and Makwanpur. In altitude it ranges from about 100 m (330 ft) in the river valleys to 815 m (2,674 ft) in the Churia Hills.",
    "highlights": [
      "Bengal Tigers",
      "One-Horned Rhinos",
      "Jungle Safari",
      "Elephant Breeding Center",
      "Tharu Culture",
      "Crocodile Breeding Center",
      "Bird Watching"
    ],
    "quick_fact": "Chitwan National Park is a UNESCO World Heritage site known for its diverse ecosystem that includes rare wildlife encounters in a subtropical jungle, as well as being home to over 68 species of mammals and 544 species of birds.",
    "coordinates": {
      "lat": 27.5291,
      "lng": 84.3542
    },
    "best_season": "The best time to visit Chitwan National Park is from October to December when the weather is pleasant and wildlife sightings are common.",
    "budget_tier": "mid-range",
    "local_tips": [
      "Try the local delicacy 'Tharu' cuisine for an authentic taste of the region.",
      "Book a guided jungle walk to learn more about the flora and fauna of the park.",
      "Pack light but include sturdy shoes for exploring the jungle trails."
    ],
    "description": "Chitwan National Park in Nepal is a haven for wildlife enthusiasts and nature lovers. Home to iconic species like Bengal Tigers and One-Horned Rhinos, the park offers a unique opportunity to witness these majestic creatures in their natural habitat. Besides thrilling jungle safaris and visits to the Elephant Breeding Center, visitors can immerse themselves in the vibrant Tharu culture, known for its traditional dances and colorful festivals. With its rich biodiversity and stunning landscapes, Chitwan National Park promises an unforgettable experience for all who venture into its depths.",
    "estimated_budget": 1099,
    "price_range": {
      "min": 1099,
      "max": 1599
    },
    "rating": 4.4,
    "review_count": 528
  },
  {
    "id": "dest_004",
    "name": "Bali",
    "slug": "bali-indonesia",
    "country": "Indonesia",
    "continent": "Asia",
    "image_url": "https://images.unsplash.com/photo-1537996194471-e657df975ab4?w=1200&q=80",
    "blog": "## The Island of the Gods: Bali\n\nBali is an Indonesian island known for its forested volcanic mountains, iconic rice paddies, beaches and coral reefs. The island is home to religious sites such as cliffside Uluwatu Temple. To the south, the beachside city of Kuta has lively bars, while Seminyak, Sanur and Nusa Dua are popular resort towns. The island is also known for its yoga and meditation retreats.",
    "highlights": [
      "Ubud Rice Terraces",
      "Tanah Lot Temple",
      "Seminyak Beach",
      "Mount Batur",
      "Sacred Monkey Forest"
    ],
    "quick_fact": "Island of gods featuring emerald rice paddies, ancient temples, and tropical beaches",
    "coordinates": {
      "lat": -8.3405,
      "lng": 115.092
    },
    "best_season": "April to October",
    "budget_tier": "mid-range",
    "estimated_budget": 1099,
    "price_range": {
      "min": 1099,
      "max": 1499
    },
    "rating": 4.8,
    "review_count": 2300
  },
  {
    "id": "dest_005",
    "name": "Kyoto",
    "slug": "kyoto-japan",
    "country": "Japan",
    "continent": "Asia",
    "image_url": "https://images.unsplash.com/photo-1524413840807-0c3cb6fa808d?w=1200&q=80",
    "blog": "## The Cultural Capital of Japan: Kyoto\n\nKyoto, once the capital of Japan, is a city on the island of Honshu. It's famous for its numerous classical Buddhist temples, as well as gardens, imperial palaces, Shinto shrines and traditional wood houses. It’s also known for formal traditions such as kaiseki dining, consisting of multiple courses of precise dishes, and geisha, female entertainers often found in the Gion district.",
    "highlights": [
      "Fushimi Inari Shrine",
      "Arashiyama Bamboo Grove",
      "Kinkaku-ji Temple",
      "Gion District",
      "Philosopher's Path"
    ],
    "quick_fact": "Former imperial capital preserving 2,000 temples, traditional geisha districts, and zen gardens",
    "coordinates": {
      "lat": 35.0116,
      "lng": 135.7681
    },
    "best_season": "March to May, October to November",
    "budget_tier": "luxury",
    "estimated_budget": 3499,
    "price_range": {
      "min": 3499,
      "max": 5499
    },
    "rating": 4.8,
    "review_count": 1333
  },
  {
    "id": "dest_006",
    "name": "Hanoi",
    "slug": "hanoi-vietnam",
    "country": "Vietnam",
    "continent": "Asia",
    "image_url": "https://images.unsplash.com/photo-1555952517-2e8e729e0b44?w=1200&q=80",
    "blog": "## The Charming Capital of Vietnam: Hanoi\n\nHanoi, the capital of Vietnam, is known for its centuries-old architecture and a rich culture with Southeast Asian, Chinese and French influences. At its heart is the chaotic Old Quarter, where the narrow streets are roughly arranged by trade. There are many little temples, including Bach Ma, honoring a legendary horse, plus Đồng Xuân Market, selling household goods and street food.",
    "highlights": [
      "Old Quarter",
      "Hoan Kiem Lake",
      "Temple of Literature",
      "Street Food Tours",
      "Water Puppet Theatre",
      "Hoa Lo Prison",
      "Vietnam Museum of Ethnology"
    ],
    "quick_fact": "Hanoi is a bustling city where ancient traditions blend with modern influences, creating a unique cultural experience for visitors.",
    "coordinates": {
      "lat": 21.0285,
      "lng": 105.8542
    },
    "best_season": "October to December, March to April",
    "budget_tier": "budget-friendly",
    "local_tips": [
      "Try the famous egg coffee at Giang Cafe in the Old Quarter",
      "Visit the Long Bien Bridge for a stunning view of the Red River",
      "Explore the local markets like Dong Xuan Market for authentic Vietnamese goods"
    ],
    "description": "Hanoi, the capital of Vietnam, is a city of contrasts where French colonial architecture coexists with traditional Vietnamese culture. The city's rich history is evident in its many temples, pagodas, and historic sites. Hanoi's vibrant street life, bustling markets, and delicious cuisine make it a must-visit destination for travelers looking to experience the heart of Vietnam.",
    "estimated_budget": 599,
    "price_range": {
      "min": 599,
      "max": 899
    },
    "rating": 4.8,
    "review_count": 1811
  },
  {
    "id": "dest_007",
    "name": "Porto",
    "slug": "porto-portugal",
    "country": "Portugal",
    "continent": "Europe",
    "image_url": "https://images.unsplash.com/photo-1555881400-74d7acaacd8b?w=1200&q=80",
    "blog": "## The Coastal Gem of Portugal: Porto\n\nPorto is a coastal city in northwest Portugal known for its stately bridges and port wine production. In the medieval Ribeira (riverside) district, narrow cobbled streets wind past merchants’ houses and cafes. São Francisco Church is known for its lavish baroque interior with ornate gilded carvings. The palatial 19th-century Palácio de Bolsa, formerly a stock market, was built to impress potential European investors.",
    "highlights": [
      "Dom Luís I Bridge",
      "Ribeira District",
      "Port Wine Cellars",
      "Livraria Lello",
      "Clérigos Tower",
      "Serralves Museum",
      "Clerigos Church"
    ],
    "quick_fact": "Porto is a charming riverside city known for its historic architecture, delicious port wine, colorful azulejo tiles, and stunning coastal views.",
    "coordinates": {
      "lat": 41.1579,
      "lng": -8.6291
    },
    "best_season": "Late spring to early autumn (May to October)",
    "budget_tier": "mid-range",
    "local_tips": [
      "Try the local specialty 'Francesinha', a hearty sandwich with layers of meat and cheese smothered in a beer-based sauce.",
      "Take a boat cruise along the Douro River to admire Porto's skyline and the picturesque vineyard-covered hillsides of the Douro Valley.",
      "Visit the Mercado do Bolhão, a traditional market where you can sample fresh produce, local cheeses, and traditional Portuguese delicacies."
    ],
    "description": "Porto, a city in northern Portugal, is a vibrant destination with a rich history and a blend of old-world charm and modern attractions. The city's hilly landscape provides breathtaking views of the Douro River and the iconic Dom Luís I Bridge. Porto is best known for its production of port wine, which can be sampled in the numerous wine cellars along the riverfront. Visitors can explore the narrow streets of the Ribeira District, visit the ornate Livraria Lello bookstore, climb the Clérigos Tower for panoramic views, and marvel at the contemporary art at the Serralves Museum. With its warm climate and lively atmosphere, Porto is a must-visit destination for any traveler.",
    "estimated_budget": 1499,
    "price_range": {
      "min": 1499,
      "max": 2299
    },
    "rating": 4.5,
    "review_count": 1949
  },
  {
    "id": "dest_008",
    "name": "Reykjavik",
    "slug": "reykjavik-iceland",
    "country": "Iceland",
    "continent": "Europe",
    "image_url": "https://images.unsplash.com/photo-1504893524553-b855bce32c67?w=1200&q=80",
    "blog": "## The Gateway to Iceland's Wonders: Reykjavik\n\nReykjavik, on the coast of Iceland, is the country's capital and largest city. It's home to the National and Saga museums, tracing Iceland’s Viking history. The striking concrete Hallgrímskirkja church and rotating Perlan glass dome offer sweeping views of the sea and nearby hills. Exemplifying the island’s volcanic activity is the geothermal Blue Lagoon spa, near the village of Grindavík.",
    "highlights": [
      "Blue Lagoon",
      "Northern Lights",
      "Hallgrímskirkja Church",
      "Golden Circle",
      "Perlan Museum",
      "Harpa Concert Hall",
      "Whale Watching Tours"
    ],
    "quick_fact": "Reykjavik, the world's northernmost capital, is known for its geothermal wonders, vibrant arts scene, and unique Icelandic culture.",
    "coordinates": {
      "lat": 64.1265,
      "lng": -21.8174
    },
    "best_season": "June to August for summer activities and festivals, September to March for viewing the Northern Lights",
    "budget_tier": "mid-range",
    "local_tips": [
      "Don't miss trying traditional Icelandic cuisine like fermented shark and smoked lamb",
      "Take a dip in one of Reykjavik's many geothermal pools like Laugardalslaug",
      "Explore the vibrant street art scene in the city center"
    ],
    "description": "Reykjavik, the capital of Iceland, is a charming city known for its stunning natural landscapes, geothermal hot springs, and unique cultural heritage. Visitors can experience the geothermal spa at the Blue Lagoon, marvel at the natural phenomenon of the Northern Lights, and explore the iconic Hallgrímskirkja Church. The city also offers a vibrant arts and music scene, with venues like the Harpa Concert Hall hosting various performances. Reykjavik is a perfect blend of natural beauty and modern urban life, making it a must-visit destination for any traveler.",
    "estimated_budget": 2499,
    "price_range": {
      "min": 2499,
      "max": 3999
    },
    "rating": 4.7,
    "review_count": 963
  },
  {
    "id": "dest_009",
    "name": "Dubrovnik",
    "slug": "dubrovnik-croatia",
    "country": "Croatia",
    "continent": "Europe",
    "image_url": "https://images.unsplash.com/photo-1562214526-2e3348c1313a?w=1200&q=80",
    "blog": "## The Pearl of the Adriatic: Dubrovnik\n\nDubrovnik is a city in southern Croatia fronting the Adriatic Sea. It's known for its distinctive Old Town, encircled with massive stone walls completed in the 16th century. Its well-preserved buildings range from baroque St. Blaise Church to Renaissance Sponza Palace and Gothic Rector’s Palace, now a history museum. Paved with limestone, the pedestrianized Stradun (or Placa) is lined with shops and restaurants.",
    "highlights": [
      "Old Town Walls",
      "Stradun Street",
      "Lokrum Island",
      "Cable Car Views",
      "Game of Thrones Sites",
      "Banje Beach",
      "Dubrovnik Cathedral"
    ],
    "quick_fact": "Dubrovnik, known as the 'Pearl of the Adriatic', boasts a stunning blend of medieval architecture, pristine waters, and vibrant culture.",
    "coordinates": {
      "lat": 42.6507,
      "lng": 18.0944
    },
    "best_season": "The best time to visit Dubrovnik is from May to June and September to October when the weather is pleasant and the crowds are thinner.",
    "budget_tier": "mid-range",
    "local_tips": [
      "Take a sunset cruise along the coast for breathtaking views of the city and surrounding islands.",
      "Explore the hidden gems of Dubrovnik by wandering off the main streets into the narrow alleys and staircases.",
      "Sample traditional Croatian cuisine at local eateries outside the touristy areas for an authentic experience."
    ],
    "description": "Dubrovnik, located in Croatia, is a picturesque coastal city known for its well-preserved medieval walls, historic Old Town, and stunning Adriatic Sea views. Visitors can immerse themselves in the rich history of the city by exploring ancient fortresses, charming churches, and lively markets. Dubrovnik also offers opportunities for outdoor activities such as kayaking, snorkeling, and hiking on nearby trails. With its unique blend of cultural heritage and natural beauty, Dubrovnik is a must-visit destination for travelers seeking a mix of history, relaxation, and adventure.",
    "estimated_budget": 1599,
    "price_range": {
      "min": 1599,
      "max": 2699
    },
    "rating": 4.5,
    "review_count": 3016
  },
  {
    "id": "dest_010",
    "name": "Prague",
    "slug": "prague-czech-republic",
    "country": "Czech Republic",
    "continent": "Europe",
    "image_url": "https://images.unsplash.com/photo-1583881262487-5b34b9a1517a?w=1200&q=80",
    "blog": "## The City of a Hundred Spires: Prague\n\nPrague, capital city of the Czech Republic, is bisected by the Vltava River. Nicknamed “the City of a Hundred Spires,” it's known for its Old Town Square, the heart of its historic core, with colorful baroque buildings, Gothic churches and the medieval Astronomical Clock, which gives an animated hourly show. Completed in 1402, pedestrian Charles Bridge is lined with statues of Catholic saints.",
    "highlights": [
      "Charles Bridge",
      "Prague Castle",
      "Old Town Square",
      "Astronomical Clock",
      "Vltava River Cruise",
      "St. Vitus Cathedral",
      "Petřín Hill and Observation Tower"
    ],
    "quick_fact": "Known as the 'City of a Hundred Spires', Prague is a picturesque city with a rich history and stunning architectural blend of Gothic, Baroque, and Art Nouveau styles.",
    "coordinates": {
      "lat": 50.0755,
      "lng": 14.4378
    },
    "best_season": "The best time to visit Prague is in the spring (April to May) and fall (September to October) when the weather is mild and the crowds are thinner.",
    "budget_tier": "mid-range",
    "local_tips": [
      "Visit the John Lennon Wall for a colorful display of street art and messages of peace",
      "Explore the Jewish Quarter for its historical significance and synagogues",
      "Try traditional Czech cuisine like goulash and trdelník from local eateries"
    ],
    "description": "Prague, the capital of the Czech Republic, is a city known for its stunning architecture, historic landmarks, and vibrant culture. From the iconic Charles Bridge to the majestic Prague Castle, visitors can immerse themselves in centuries of history. The Old Town Square with its Astronomical Clock is a hub of activity, while a cruise along the Vltava River offers panoramic views of the city. With its fairy-tale charm and welcoming atmosphere, Prague is a must-visit destination in Europe.",
    "estimated_budget": 1599,
    "price_range": {
      "min": 1599,
      "max": 2499
    },
    "rating": 4.9,
    "review_count": 3197
  },
  {
    "id": "dest_011",
    "name": "Cartagena",
    "slug": "cartagena-colombia",
    "country": "Colombia",
    "continent": "South America",
    "image_url": "https://images.unsplash.com/photo-1568632234157-ce7aecd03d0d?w=1200&q=80",
    "blog": "## The Jewel of the Caribbean: Cartagena\n\nCartagena is a port city on Colombia’s Caribbean coast. By the sea is the walled Old Town, founded in the 16th century, with squares, cobblestone streets and colorful colonial buildings. With a tropical climate, the city is also a popular beach destination. Reachable by boat are the nearby Islas del Rosario, known for their coral reefs and snorkeling.",
    "highlights": [
      "Walled City",
      "Castillo San Felipe",
      "Rosario Islands",
      "Getsemaní Neighborhood",
      "Street Art",
      "Mud Volcano Tour",
      "La Popa Monastery"
    ],
    "quick_fact": "Cartagena is a UNESCO World Heritage site known for its well-preserved colonial architecture, vibrant culture, and blend of Caribbean and Spanish influences.",
    "coordinates": {
      "lat": 10.391,
      "lng": -75.4794
    },
    "best_season": "December to March for the driest weather and less humidity",
    "budget_tier": "mid-range",
    "local_tips": [
      "Try local dishes like arepas and ceviche for an authentic culinary experience",
      "Explore the local markets in Getsemaní for handmade crafts and souvenirs",
      "Take a sunset cruise around the bay for stunning views of the city"
    ],
    "description": "Cartagena, a city on Colombia's Caribbean coast, is a magical destination where history and modernity blend seamlessly. The Walled City, with its colorful buildings and cobblestone streets, is a treasure trove of colonial architecture. Castillo San Felipe offers a glimpse into the city's military past, while the Rosario Islands provide a tropical escape just a short boat ride away. Getsemaní Neighborhood is a bohemian hotspot known for its street art and vibrant nightlife. With salsa rhythms in the air and a mix of Caribbean and Spanish influences, Cartagena is a city that captivates all who visit.",
    "estimated_budget": 1199,
    "price_range": {
      "min": 1199,
      "max": 1899
    },
    "rating": 4.8,
    "review_count": 1767
  },
  {
    "id": "dest_012",
    "name": "Banff",
    "slug": "banff-canada",
    "country": "Canada",
    "continent": "North America",
    "image_url": "https://images.unsplash.com/photo-1503614472-8c93d56e92ce?w=1200&q=80",
    "blog": "## The Heart of the Rockies: Banff\n\nBanff is a resort town in the province of Alberta, located within Banff National Park. The peaks of Mt. Rundle and Mt. Cascade, part of the Rocky Mountains, dominate its skyline. On Banff Avenue, the main thoroughfare, boutiques and restaurants mix with château-style hotels and souvenir shops. The surrounding 6,500 square kilometers of parkland are home to wildlife including elk and grizzly bears.",
    "highlights": [
      "Lake Louise",
      "Moraine Lake",
      "Banff Gondola",
      "Hot Springs",
      "Wildlife Spotting",
      "Peyto Lake",
      "Johnston Canyon"
    ],
    "quick_fact": "Banff, nestled in the Canadian Rockies, is renowned for its stunning turquoise glacial lakes, rugged mountains, and diverse wildlife.",
    "coordinates": {
      "lat": 51.4968,
      "lng": -115.9281
    },
    "best_season": "June to August (summer) for hiking and outdoor activities, December to March for skiing and winter sports",
    "budget_tier": "mid-range",
    "local_tips": [
      "Take the Banff Gondola at sunset for breathtaking views",
      "Explore the Icefields Parkway for stunning scenery",
      "Visit the Banff Park Museum for local history"
    ],
    "description": "Banff, located in Canada's Alberta province, is a picturesque town within the Banff National Park. Known for its pristine wilderness and outdoor recreational opportunities, Banff attracts visitors seeking adventure and natural beauty. From the iconic Lake Louise and Moraine Lake to the soothing Hot Springs and diverse wildlife, Banff offers a unique blend of experiences for nature lovers and outdoor enthusiasts alike.",
    "estimated_budget": 1999,
    "price_range": {
      "min": 1999,
      "max": 3499
    },
    "rating": 4.7,
    "review_count": 3222
  },
  {
    "id": "dest_013",
    "name": "Cusco",
    "slug": "cusco-peru",
    "country": "Peru",
    "continent": "South America",
    "image_url": "https://images.unsplash.com/photo-1587595431973-160d0d94add1?w=1200&q=80",
    "blog": "## The Gateway to Machu Picchu: Cusco\n\nCusco, a city in the Peruvian Andes, was once capital of the Inca Empire, and is now known for its archaeological remains and Spanish colonial architecture. Plaza de Armas is the central square in the old city, with arcades, carved wooden balconies and Incan wall ruins. The baroque Santo Domingo Convent was built on top of the Incan Temple of the Sun (Qoricancha), and has archaeological remains of Inca stonework.",
    "highlights": [
      "Machu Picchu Gateway",
      "Plaza de Armas",
      "Sacred Valley",
      "Inca Ruins",
      "Rainbow Mountain",
      "Saksaywaman",
      "Qorikancha Temple"
    ],
    "quick_fact": "Cusco, the ancient Inca capital, is located at an altitude of 11,000 feet and serves as the gateway to the legendary Machu Picchu, a UNESCO World Heritage Site.",
    "coordinates": {
      "lat": -13.5319,
      "lng": -71.9675
    },
    "best_season": "The best time to visit Cusco is from May to September when the weather is dry and sunny.",
    "budget_tier": "mid-range",
    "local_tips": [
      "Acclimate to the high altitude before engaging in strenuous activities.",
      "Try the local Peruvian cuisine like ceviche and alpaca meat dishes.",
      "Bargain at the local markets for souvenirs and handicrafts."
    ],
    "description": "Cusco, a city in southeastern Peru, was once the capital of the Inca Empire and is known for its archaeological remains and Spanish colonial architecture. The city is a popular tourist destination due to its proximity to the iconic Machu Picchu. Visitors can explore the historic Plaza de Armas, marvel at the ancient Inca ruins scattered throughout the region, and embark on excursions to the stunning Rainbow Mountain and Sacred Valley. With a rich cultural heritage and breathtaking landscapes, Cusco offers a unique travel experience for history buffs and outdoor enthusiasts alike.",
    "estimated_budget": 1599,
    "price_range": {
      "min": 1599,
      "max": 2299
    },
    "rating": 4.5,
    "review_count": 1452
  },
  {
    "id": "dest_014",
    "name": "Tulum",
    "slug": "tulum-mexico",
    "country": "Mexico",
    "continent": "North America",
    "image_url": "https://images.unsplash.com/photo-1518509562904-e7ef99cdcc86?w=1200&q=80",
    "blog": "## The Bohemian Paradise: Tulum\n\nTulum is a town on the Caribbean coastline of Mexico’s Yucatán Peninsula. It’s known for its beaches and well-preserved ruins of an ancient Mayan port city. The main building is a large stone structure called El Castillo (castle), perched on a rocky cliff above the white sand beach and turquoise sea. Near the ruins is the Parque Nacional Tulum, a coastal area with mangroves and cenotes (natural limestone sinkholes).",
    "highlights": [
      "Beachfront Mayan Ruins",
      "Cenotes exploration",
      "Gran Cenote swimming",
      "Sian Ka'an Biosphere Reserve tour",
      "Relaxing at Beach Clubs",
      "Scuba diving in crystal-clear waters",
      "Exploring Tulum's eco-friendly resorts"
    ],
    "quick_fact": "Tulum is a laid-back beach destination known for its bohemian vibe, eco-conscious resorts, and stunning views of Mayan ruins perched on cliffs overlooking the turquoise waters of the Caribbean Sea.",
    "coordinates": {
      "lat": 20.2114,
      "lng": -87.4654
    },
    "best_season": "December to March for optimal weather with less humidity and rainfall",
    "budget_tier": "mid-range",
    "local_tips": [
      "Rent a bike to easily explore Tulum's beaches and cenotes",
      "Try the local seafood at beachfront restaurants",
      "Visit the Tulum Ruins early in the morning to avoid crowds and heat",
      "Pack eco-friendly sunscreen to protect the coral reefs",
      "Attend a yoga class or wellness retreat at one of Tulum's many eco-resorts"
    ],
    "description": "Tulum, located on the Yucatan Peninsula in Mexico, is a trendy and eco-conscious beach destination that offers a unique blend of relaxation, adventure, and cultural exploration. Visitors can explore ancient Mayan ruins with breathtaking ocean views, swim in crystal-clear cenotes, and discover the diverse marine life of the Sian Ka'an Biosphere Reserve. Tulum's bohemian atmosphere, eco-friendly accommodations, and vibrant beach clubs make it a popular choice for travelers seeking a laid-back yet stylish vacation experience.",
    "estimated_budget": 1999,
    "price_range": {
      "min": 1999,
      "max": 2999
    },
    "rating": 4.5,
    "review_count": 1571
  },
  {
    "id": "dest_015",
    "name": "Marrakech",
    "slug": "marrakech-morocco",
    "country": "Morocco",
    "continent": "Africa",
    "image_url": "https://images.unsplash.com/photo-1597212618440-806262de4f6b?w=1200&q=80",
    "blog": "## The Red City: Marrakech\n\nMarrakech, a former imperial city in western Morocco, is a major economic center and home to mosques, palaces and gardens. The medina is a densely packed, walled medieval city dating to the Berber Empire, with mazelike alleys where thriving souks (marketplaces) sell traditional textiles, pottery and jewelry. A symbol of the city, and visible for miles, is the Moorish minaret of 12th-century Koutoubia Mosque.",
    "highlights": [
      "Jemaa el-Fnaa Square",
      "Majorelle Garden",
      "Bahia Palace",
      "Souks",
      "Atlas Mountains Day Trip",
      "Koutoubia Mosque",
      "Saadian Tombs"
    ],
    "quick_fact": "Marrakech, known as the 'Red City', is a vibrant hub of Moroccan culture where bustling souks, traditional riads, and colorful markets captivate visitors.",
    "coordinates": {
      "lat": 31.6295,
      "lng": -7.9811
    },
    "best_season": "March to May for pleasant weather and blooming gardens, September to November for fewer crowds",
    "budget_tier": "mid-range",
    "local_tips": [
      "Bargain at the souks for unique souvenirs",
      "Try traditional Moroccan mint tea at local cafes",
      "Respect local customs and dress modestly, especially when visiting religious sites"
    ],
    "description": "Marrakech is a mesmerizing city in Morocco, offering a sensory journey through its historic landmarks, bustling markets, and stunning natural landscapes. From the lively Jemaa el-Fnaa Square to the peaceful Majorelle Garden, visitors can immerse themselves in the rich cultural tapestry of the city. The intricate architecture of the Bahia Palace and the vibrant atmosphere of the Souks provide a glimpse into Marrakech's past and present. A day trip to the nearby Atlas Mountains offers breathtaking scenery and outdoor adventures. With its unique blend of tradition and modernity, Marrakech is a must-visit destination for travelers seeking an unforgettable experience in North Africa.",
    "estimated_budget": 1499,
    "price_range": {
      "min": 1499,
      "max": 2199
    },
    "rating": 4.7,
    "review_count": 1683
  },
  {
    "id": "dest_016",
    "name": "Cape Town",
    "slug": "cape-town-south-africa",
    "country": "South Africa",
    "continent": "Africa",
    "image_url": "https://images.unsplash.com/photo-1580060839134-75a5edca2e99?w=1200&q=80",
    "blog": "## The Mother City: Cape Town\n\nCape Town is a port city on South Africa’s southwest coast, on a peninsula beneath the imposing Table Mountain. Slowly rotating cable cars climb to the mountain’s flat top, from which there are sweeping views of the city, the busy harbor and boats heading for Robben Island, the notorious prison where Nelson Mandela was held, which is now a living museum.",
    "highlights": [
      "Table Mountain",
      "Cape Point",
      "Robben Island",
      "V&A Waterfront",
      "Boulders Beach Penguins",
      "Kirstenbosch National Botanical Garden",
      "Bo-Kaap neighborhood"
    ],
    "quick_fact": "Cape Town is known as the 'Tavern of the Seas' due to its history as a stopping point for ships traveling between Europe and the Far East.",
    "coordinates": {
      "lat": -33.9249,
      "lng": 18.4241
    },
    "best_season": "November to April",
    "budget_tier": "mid-range",
    "local_tips": [
      "Take a sunset cruise from the V&A Waterfront for breathtaking views of the city and Table Mountain.",
      "Visit the Neighbourgoods Market at the Old Biscuit Mill on Saturdays for a taste of local food and crafts.",
      "Explore the Cape Winelands region just outside of Cape Town for world-class wine tasting experiences."
    ],
    "description": "Cape Town, located at the southern tip of Africa, is a vibrant city known for its stunning natural beauty, diverse culture, and rich history. From the iconic Table Mountain to the historic Robben Island, visitors can immerse themselves in a mix of outdoor adventures, cultural experiences, and culinary delights. Whether you're exploring the bustling streets of the city center or relaxing on the pristine beaches along the coast, Cape Town offers a truly unforgettable travel experience.",
    "estimated_budget": 2099,
    "price_range": {
      "min": 2099,
      "max": 2899
    },
    "rating": 4.7,
    "review_count": 611
  },
  {
    "id": "dest_017",
    "name": "Zanzibar",
    "slug": "zanzibar-tanzania",
    "country": "Tanzania",
    "continent": "Africa",
    "image_url": "https://images.unsplash.com/photo-1584949091598-c34daaaa4aa9?w=1200&q=80",
    "blog": "## The Spice Island: Zanzibar\n\nZanzibar is a Tanzanian archipelago off the coast of East Africa. On its main island, Unguja, familiarly called Zanzibar, is Stone Town, a historic trade center with Swahili and Islamic influences. Its winding lanes present minarets, carved doorways and 19th-century landmarks such as the House of Wonders, a former sultan’s palace. The northern villages Nungwi and Kendwa have wide beaches lined with hotels.",
    "highlights": [
      "Stone Town",
      "Nungwi Beach",
      "Spice Plantations",
      "Jozani Forest",
      "Dhow Sunset Cruises",
      "Prison Island",
      "Kendwa Beach"
    ],
    "quick_fact": "Zanzibar, known as the 'Spice Island', is a tropical paradise in the Indian Ocean renowned for its rich history and cultural fusion of Swahili, Arab, and Portuguese influences set against stunning white sandy beaches.",
    "coordinates": {
      "lat": -6.1659,
      "lng": 39.2026
    },
    "best_season": "June to October for dry season and cooler temperatures",
    "budget_tier": "mid-range",
    "local_tips": [
      "Try the local street food in Stone Town for an authentic culinary experience",
      "Visit the Forodhani Gardens night market for delicious seafood and local snacks",
      "Explore the underwater world with snorkeling or diving excursions in the crystal-clear waters"
    ],
    "description": "Zanzibar, a semi-autonomous region of Tanzania, is a captivating destination that offers a blend of history, culture, and natural beauty. From the narrow streets and bustling markets of Stone Town to the idyllic beaches of Nungwi and Kendwa, Zanzibar caters to a wide range of travelers. The island's spice plantations, such as the popular Spice Tour, showcase its historical importance as a major trading hub. Nature lovers can immerse themselves in the lush greenery of Jozani Forest, home to the endemic Red Colobus monkeys. For a relaxing experience, sunset cruises on traditional Dhow boats provide a picturesque way to enjoy the island's stunning coastline. Zanzibar truly offers a unique and unforgettable travel experience.",
    "estimated_budget": 1999,
    "price_range": {
      "min": 1999,
      "max": 3199
    },
    "rating": 4.4,
    "review_count": 3130
  },
  {
    "id": "dest_018",
    "name": "Queenstown",
    "slug": "queenstown-new-zealand",
    "country": "New Zealand",
    "continent": "Oceania",
    "image_url": "https://images.unsplash.com/photo-1507699622108-4be3abd695ad?w=1200&q=80",
    "blog": "## The Adventure Capital of the World: Queenstown\n\nQueenstown, New Zealand, sits on the shores of the South Island’s Lake Wakatipu, set against the dramatic Southern Alps. Renowned for adventure sports, it’s also a base for exploring the region’s vineyards and historic mining towns. There's bungee jumping off Kawarau Gorge Suspension Bridge and jet-boating on the Shotover and Dart rivers. In winter, there's skiing on the slopes of The Remarkables and Coronet Peak.",
    "highlights": [
      "Milford Sound",
      "Bungee Jumping",
      "Lake Wakatipu",
      "Skyline Gondola",
      "Wine Tours",
      "Fergburger",
      "Glenorchy"
    ],
    "quick_fact": "Known as the adventure capital of the world, Queenstown offers a unique blend of adrenaline-pumping activities and breathtaking natural beauty, making it a must-visit destination for thrill-seekers and nature lovers alike.",
    "coordinates": {
      "lat": -45.0312,
      "lng": 168.6626
    },
    "best_season": "December to February for summer activities and outdoor adventures, June to August for skiing and snow sports",
    "budget_tier": "mid-range",
    "local_tips": [
      "Try the famous Fergburger for a delicious and filling meal",
      "Take a scenic drive to Glenorchy for stunning views of the surrounding mountains and Lake Wakatipu",
      "Visit Arrowtown for a taste of the region's gold rush history"
    ],
    "description": "Queenstown, located on the shores of Lake Wakatipu, is a picturesque town known for its adventure sports, stunning landscapes, and vibrant culinary scene. Whether you're bungee jumping off Kawarau Bridge, cruising through Milford Sound, or wine tasting in the nearby vineyards, Queenstown offers a diverse range of activities for every type of traveler. With its proximity to the Southern Alps, Queenstown is a popular destination for skiing and snowboarding in the winter months, while the summer season brings opportunities for hiking, mountain biking, and water sports. The town's lively atmosphere, coupled with its breathtaking surroundings, makes it a top destination in New Zealand.",
    "estimated_budget": 2199,
    "price_range": {
      "min": 2199,
      "max": 3299
    },
    "rating": 4.8,
    "review_count": 2405
  },
  {
    "id": "dest_019",
    "name": "Great Barrier Reef",
    "slug": "great-barrier-reef-australia",
    "country": "Australia",
    "continent": "Oceania",
    "image_url": "https://images.unsplash.com/photo-1549965822-199c7360b284?w=1200&q=80",
    "blog": "## The World's Largest Coral Reef: Great Barrier Reef\n\nThe Great Barrier Reef, off the coast of Queensland in northeastern Australia, is the largest living thing on Earth, visible from outer space. The 2,300km-long ecosystem comprises thousands of reefs and hundreds of islands made of over 600 types of hard and soft coral. It’s home to countless species of colorful fish, mollusks and starfish, plus turtles, dolphins and sharks.",
    "highlights": [
      "Snorkeling Paradise",
      "Diving Expeditions",
      "Whitehaven Beach",
      "Heart Reef",
      "Marine Wildlife",
      "Seaplane Tours",
      "Island Hopping"
    ],
    "quick_fact": "The Great Barrier Reef is the world's largest coral reef system stretching over 2,300 kilometers and is home to over 1,500 species of fish and 400 types of coral.",
    "coordinates": {
      "lat": -18.2871,
      "lng": 147.6992
    },
    "best_season": "The best time to visit the Great Barrier Reef is during the dry season from June to November when the weather is sunny and the water visibility is at its best.",
    "budget_tier": "mid-range",
    "local_tips": [
      "Book snorkeling and diving tours in advance to secure your spot",
      "Protect the reef by using reef-safe sunscreen",
      "Explore the outer reef for less crowded and more pristine dive sites"
    ],
    "description": "The Great Barrier Reef is a UNESCO World Heritage Site and one of the most iconic natural wonders on Earth. It offers unparalleled opportunities for snorkeling, diving, and exploring vibrant marine life. Visitors can enjoy crystal-clear waters, stunning coral formations, and the chance to encounter majestic marine creatures like turtles, dolphins, and reef sharks. With its breathtaking beauty and ecological significance, the Great Barrier Reef is a must-visit destination for nature lovers and adventure seekers alike.",
    "estimated_budget": 1799,
    "price_range": {
      "min": 1799,
      "max": 2499
    },
    "rating": 4.8,
    "review_count": 1445
  },
  {
    "id": "dest_020",
    "name": "Fiji Islands",
    "slug": "fiji-islands-fiji",
    "country": "Fiji",
    "continent": "Oceania",
    "image_url": "https://images.unsplash.com/photo-1562553281-dd39392039e4?w=1200&q=80",
    "blog": "## The Soft Coral Capital of the World: Fiji\n\nFiji, a country in the South Pacific, is an archipelago of more than 300 islands. It's famed for rugged landscapes, palm-lined beaches and coral reefs with clear lagoons. Its major islands, Viti Levu and Vanua Levu, contain most of the population. Viti Levu is home to the capital, Suva, a port city with British colonial architecture. The Fiji Museum, in the Victorian-era Thurston Gardens, has ethnographic exhibits.",
    "highlights": [
      "Yasawa Islands",
      "Coral Reefs",
      "Traditional Kava Ceremony",
      "Cloud 9 Floating Bar",
      "Island Hopping",
      "Snorkeling with Manta Rays",
      "Exploring Taveuni's Waterfalls"
    ],
    "quick_fact": "Fiji is composed of 333 tropical islands known for their white sand beaches, crystal-clear waters, vibrant coral reefs, and the warm hospitality of the locals known as the Bula spirit.",
    "coordinates": {
      "lat": -17.7134,
      "lng": 178.065
    },
    "best_season": "The best time to visit Fiji is during the dry season from May to October when the weather is cooler and drier, perfect for outdoor activities.",
    "budget_tier": "mid-range",
    "local_tips": [
      "Try local delicacies like Kokoda (Fijian ceviche) and Lovo (earth oven-cooked meats and vegetables)",
      "Respect the local customs and traditions, such as covering up when visiting villages",
      "Explore the local markets for authentic handicrafts and souvenirs"
    ],
    "description": "The Fiji Islands, located in the heart of the South Pacific, offer a tropical paradise with pristine beaches, lush jungles, and a rich cultural heritage. Visitors can immerse themselves in the traditional Fijian way of life by participating in Kava ceremonies, exploring remote islands like the Yasawas, and experiencing the vibrant marine life through activities like snorkeling and diving. Whether seeking relaxation on the beach or adventure in the water, Fiji provides a perfect blend of luxury and natural beauty.",
    "estimated_budget": 2199,
    "price_range": {
      "min": 2199,
      "max": 3999
    },
    "rating": 4.6,
    "review_count": 1150
  },
  {
    "id": "dest_84d4f8",
    "name": "Mount Kilimanjaro",
    "slug": "mount-kilimanjaro-tanzania",
    "country": "Tanzania",
    "continent": "Africa",
    "image_url": "https://images.unsplash.com/photo-1544735716-392fe2489ffa?w=1200&q=80",
    "highlights": [
      "Kilimanjaro Trek",
      "Uhuru Peak",
      "Diverse Ecosystems"
    ],
    "quick_fact": "Mount Kilimanjaro is Africa's highest peak and the world's tallest free-standing mountain.",
    "coordinates": {
      "lat": -3.066389,
      "lng": 37.355
    },
    "best_season": "January to March and June to October",
    "budget_tier": "luxury",
    "local_tips": [
      "Acclimatize properly to avoid altitude sickness",
      "Pack warm layers for summit night",
      "Choose a reputable guide service"
    ],
    "description": "Experience the ultimate African adventure with a trek to the summit of Mount Kilimanjaro. This iconic climb takes you through five distinct climate zones, from rainforest to arctic conditions, culminating in breathtaking views from Africa's highest peak.",
    "estimated_budget": 4999,
    "price_range": {
      "min": 4999,
      "max": 7999
    },
    "rating": 4.6,
    "review_count": 2399
  },
  {
    "id": "dest_128761",
    "name": "Inca Trail",
    "slug": "inca-trail-peru",
    "country": "Peru",
    "continent": "South America",
    "image_url": "https://images.unsplash.com/photo-1526392060635-9d6019884377?w=1200&q=80",
    "highlights": [
      "Machu Picchu Approach",
      "Ancient Inca Ruins",
      "Andes Mountain Views"
    ],
    "quick_fact": "The classic Inca Trail is a 26-mile trek that ends at the Sun Gate overlooking Machu Picchu.",
    "coordinates": {
      "lat": -13.1631,
      "lng": -72.545
    },
    "best_season": "May to September",
    "budget_tier": "mid-range",
    "local_tips": [
      "Book permits well in advance",
      "Train your body before arrival",
      "Bring good hiking boots"
    ],
    "description": "Walk in the footsteps of the ancient Incas on this legendary four-day trek to the lost city of Machu Picchu. Experience breathtaking mountain scenery, ancient ruins, and diverse ecosystems.",
    "estimated_budget": 1499,
    "price_range": {
      "min": 1499,
      "max": 2499
    },
    "rating": 4.6,
    "review_count": 2901
  },
  {
    "id": "dest_e7894a",
    "name": "Milford Track",
    "slug": "milford-track-new-zealand",
    "country": "New Zealand",
    "continent": "Oceania",
    "image_url": "https://images.unsplash.com/photo-1469521669194-babb45f83513?w=1200&q=80",
    "highlights": [
      "Fiordland National Park",
      "Sutherland Falls",
      "Mackinnon Pass"
    ],
    "quick_fact": "The Milford Track is considered one of the finest walks in the world, traversing through New Zealand's most stunning landscapes.",
    "coordinates": {
      "lat": -44.7917,
      "lng": 167.9583
    },
    "best_season": "October to April",
    "budget_tier": "mid-range",
    "local_tips": [
      "Book huts well in advance",
      "Pack waterproof gear",
      "Consider guided walks"
    ],
    "description": "Experience New Zealand's most famous hiking trail through pristine wilderness, cascading waterfalls, and dramatic mountain scenery. The 33-mile journey takes four days and offers some of the most spectacular views in the world.",
    "estimated_budget": 2499,
    "price_range": {
      "min": 2499,
      "max": 3999
    },
    "rating": 4.5,
    "review_count": 2041
  },
  {
    "id": "dest_f48c9a",
    "name": "Tour du Mont Blanc",
    "slug": "tour-du-mont-blanc-france-italy-switzerland",
    "country": "France/Italy/Switzerland",
    "continent": "Europe",
    "image_url": "https://images.unsplash.com/photo-1516144651102-3965c700c4ae?w=1200&q=80",
    "highlights": [
      "Alpine Trekking",
      "Glacier Views",
      "Mountain Huts"
    ],
    "quick_fact": "This circular trek around Mont Blanc passes through three countries and covers approximately 170km.",
    "coordinates": {
      "lat": 45.8333,
      "lng": 6.8667
    },
    "best_season": "June to September",
    "budget_tier": "mid-range",
    "local_tips": [
      "Book accommodations early",
      "Bring layers for changing weather",
      "Consider guided tours"
    ],
    "description": "Experience the grandeur of the Alps on this classic multi-day trek around Western Europe's highest peak. The route passes through charming villages, alpine meadows, and offers stunning views of snow-capped peaks.",
    "estimated_budget": 1699,
    "price_range": {
      "min": 1699,
      "max": 2799
    },
    "rating": 4.8,
    "review_count": 595
  },
  {
    "id": "dest_5ad0a5",
    "name": "Appalachian Trail",
    "slug": "appalachian-trail-united-states",
    "country": "United States",
    "continent": "North America",
    "image_url": "https://images.unsplash.com/photo-1547531455-c2056375ddaa?w=1200&q=80",
    "highlights": [
      "Long-Distance Hiking",
      "Forest Wilderness",
      "Mountain Views"
    ],
    "quick_fact": "The Appalachian Trail is approximately 2,190 miles long, stretching from Georgia to Maine.",
    "coordinates": {
      "lat": 34.6084,
      "lng": -84.2768
    },
    "best_season": "March to October",
    "budget_tier": "budget-friendly",
    "local_tips": [
      "Plan resupply points carefully",
      "Get a trail map and guidebook",
      "Start with shorter sections"
    ],
    "description": "Discover the legendary Appalachian Trail, America's most famous long-distance hiking path. This iconic trail winds through 14 states, offering diverse landscapes from dense forests to panoramic mountain vistas.",
    "estimated_budget": 499,
    "price_range": {
      "min": 499,
      "max": 899
    },
    "rating": 4.5,
    "review_count": 758
  },
  {
    "id": "dest_0799aa",
    "name": "Drakensberg Mountains",
    "slug": "drakensberg-mountains-south-africa",
    "country": "South Africa",
    "continent": "Africa",
    "image_url": "https://images.unsplash.com/photo-1627391675388-24105f37140f?w=1200&q=80",
    "highlights": [
      "Blyde River Canyon",
      "Amphitheatre Hiking",
      "Ancient Rock Art"
    ],
    "quick_fact": "The Drakensberg range contains the highest mountain in South Africa and offers some of the country's most spectacular hiking.",
    "coordinates": {
      "lat": -29.1455,
      "lng": 29.2144
    },
    "best_season": "April to October",
    "budget_tier": "mid-range",
    "local_tips": [
      "Hire local guides for safety",
      "Pack warm layers for high altitudes",
      "Respect local cultural sites"
    ],
    "description": "Explore the dramatic peaks and valleys of South Africa's Drakensberg Mountains. This UNESCO World Heritage site offers challenging hikes with breathtaking views, ancient San rock art, and diverse wildlife.",
    "estimated_budget": 999,
    "price_range": {
      "min": 999,
      "max": 1699
    },
    "rating": 4.7,
    "review_count": 3324
  },
  {
    "id": "dest_83a3da",
    "name": "Torres del Paine",
    "slug": "torres-del-paine-chile",
    "country": "Chile",
    "continent": "South America",
    "image_url": "https://images.unsplash.com/photo-1518182170546-0766ca6f5885?w=1200&q=80",
    "highlights": [
      "Granite Towers",
      "Glacier Hiking",
      "Wildlife Viewing"
    ],
    "quick_fact": "Torres del Paine is one of the most spectacular national parks in South America.",
    "coordinates": {
      "lat": -51.0,
      "lng": -73.0
    },
    "best_season": "October to April",
    "budget_tier": "mid-range",
    "local_tips": [
      "Weather can change quickly",
      "Book campsites in advance",
      "Bring windproof gear"
    ],
    "description": "Explore the dramatic landscapes of Patagonia with its iconic granite towers, turquoise lakes, and massive glaciers. This diverse hiking region offers trails for all skill levels.",
    "estimated_budget": 1899,
    "price_range": {
      "min": 1899,
      "max": 3499
    },
    "rating": 4.6,
    "review_count": 1883
  },
  {
    "id": "dest_18362c",
    "name": "Mount Fuji",
    "slug": "mount-fuji-japan",
    "country": "Japan",
    "continent": "Asia",
    "image_url": "https://images.unsplash.com/photo-1490806843957-31f4c9a91c65?w=1200&q=80",
    "highlights": [
      "Mountain Hiking",
      "Volcanic Summit",
      "Five Lakes Region"
    ],
    "quick_fact": "Mount Fuji is Japan's highest peak at 3,776 meters and is considered one of Japan's Three Holy Mountains.",
    "coordinates": {
      "lat": 35.3606,
      "lng": 138.7274
    },
    "best_season": "July to August",
    "budget_tier": "mid-range",
    "local_tips": [
      "Start the summit climb very early to avoid crowds",
      "Bring warm layers - it's much colder at the top",
      "Visit the Five Lakes region for scenic views"
    ],
    "description": "Hike Japan's iconic Mount Fuji, an active stratovolcano and cultural symbol. The mountain offers challenging trails with rewarding panoramic views from the summit. The surrounding Five Lakes region provides excellent hiking opportunities for all skill levels.",
    "estimated_budget": 799,
    "price_range": {
      "min": 799,
      "max": 1299
    },
    "rating": 4.7,
    "review_count": 3117
  },
  {
    "id": "dest_ea1384",
    "name": "Buenos Aires",
    "slug": "buenos-aires-argentina",
    "country": "Argentina",
    "continent": "South America",
    "image_url": "https://images.unsplash.com/photo-1540959733332-eab4deabeeaf?w=1200&q=80",
    "highlights": [
      "Argentine Cuisine",
      "Steak Houses",
      "Wine Tasting"
    ],
    "quick_fact": "Buenos Aires is known as the 'Paris of South America' and is famous for its European-influenced architecture and vibrant culinary scene.",
    "coordinates": {
      "lat": -34.6037,
      "lng": -58.3816
    },
    "best_season": "October to April",
    "budget_tier": "mid-range",
    "local_tips": [
      "Try authentic Argentine beef at traditional parrillas",
      "Experience a tango dinner show",
      "Visit San Telmo market for local flavors"
    ],
    "description": "Indulge in Buenos Aires' world-renowned culinary scene, where European traditions blend with local flavors. From succulent Argentine beef and world-class wines to traditional empanadas and dulce de leche desserts, the city offers an unforgettable gastronomic journey.",
    "estimated_budget": 1599,
    "price_range": {
      "min": 1599,
      "max": 2199
    },
    "rating": 4.7,
    "review_count": 1410
  },
  {
    "id": "dest_a82fc6",
    "name": "Marrakech",
    "slug": "marrakech-morocco",
    "country": "Morocco",
    "continent": "Africa",
    "image_url": "https://images.unsplash.com/photo-1539650116574-8efeb43e2750?w=1200&q=80",
    "highlights": [
      "Moroccan Cuisine",
      "Spice Markets",
      "Traditional Tagines"
    ],
    "quick_fact": "Marrakech is known as the 'Red City' for its distinctive red sandstone buildings and is a UNESCO World Heritage site famous for its vibrant food culture.",
    "coordinates": {
      "lat": 31.6295,
      "lng": -7.9811
    },
    "best_season": "March to May, September to November",
    "budget_tier": "mid-range",
    "local_tips": [
      "Take a cooking class to learn authentic recipes",
      "Explore Jemaa el-Fnaa food stalls at night",
      "Visit the spice markets for aromatic ingredients"
    ],
    "description": "Experience the rich flavors of Moroccan cuisine in Marrakech, where aromatic spices, slow-cooked tagines, and sweet pastries create a culinary paradise. From street food in the bustling Jemaa el-Fnaa square to fine dining in riad courtyards, the city offers an authentic taste of North African culture.",
    "estimated_budget": 1499,
    "price_range": {
      "min": 1499,
      "max": 2199
    },
    "rating": 4.7,
    "review_count": 3205
  },
  {
    "id": "dest_restore_001",
    "name": "Seoul",
    "slug": "seoul-south-korea",
    "country": "South Korea",
    "continent": "Asia",
    "image_url": "https://images.unsplash.com/photo-1538485399081-7191377e8241?w=1200&q=80",
    "blog": "## The Soul of Asia: Seoul\n\nSeoul, the capital of South Korea, is a huge metropolis where modern skyscrapers, high-tech subways and pop culture meet Buddhist temples, palaces and street markets. Notable attractions include futuristic Dongdaemun Design Plaza, a convention hall with curving architecture and a rooftop park; Gyeongbokgung Palace, which once had more than 7,000 rooms; and Jogyesa Temple, site of ancient locust and pine trees.",
    "highlights": [
      "Gyeongbokgung Palace",
      "Myeongdong Shopping",
      "Bukchon Hanok Village",
      "N Seoul Tower",
      "Hongdae District"
    ],
    "quick_fact": "Dynamic metropolis where ancient palaces meet futuristic technology and K-pop culture",
    "coordinates": {
      "lat": 37.5665,
      "lng": 126.978
    },
    "best_season": "March to May, September to November",
    "budget_tier": "mid-range",
    "price_range": {
      "min": 1299,
      "max": 1799
    },
    "estimated_budget": 1299,
    "rating": 4.7,
    "review_count": 1287
  },
  {
    "id": "dest_restore_002",
    "name": "Paris",
    "slug": "paris-france",
    "country": "France",
    "continent": "Europe",
    "image_url": "https://images.unsplash.com/photo-1502602898657-3e91760cbb34?w=1200&q=80",
    "blog": "## The City of Light: Paris\n\nParis, France's capital, is a major European city and a global center for art, fashion, gastronomy and culture. Its 19th-century cityscape is crisscrossed by wide boulevards and the River Seine. Beyond such landmarks as the Eiffel Tower and the 12th-century, Gothic Notre-Dame cathedral, the city is known for its cafe culture and designer boutiques along the Rue du Faubourg Saint-Honoré.",
    "highlights": [
      "Eiffel Tower",
      "Louvre Museum",
      "Notre-Dame Cathedral",
      "Montmartre",
      "Seine River Cruise"
    ],
    "quick_fact": "Global center for art, fashion, and gastronomy known as the City of Light",
    "coordinates": {
      "lat": 48.8566,
      "lng": 2.3522
    },
    "best_season": "June to August, September to October",
    "budget_tier": "luxury",
    "price_range": {
      "min": 2199,
      "max": 2799
    },
    "estimated_budget": 2199,
    "rating": 4.7,
    "review_count": 2798
  },
  {
    "id": "dest_restore_003",
    "name": "Tokyo",
    "slug": "tokyo-japan",
    "country": "Japan",
    "continent": "Asia",
    "image_url": "https://images.unsplash.com/photo-1540959733332-eab4deabeeaf?w=1200&q=80",
    "blog": "## The Neon Metropolis: Tokyo\n\nTokyo, Japan’s busy capital, mixes the ultramodern and the traditional, from neon-lit skyscrapers to historic temples. The opulent Meiji Shinto Shrine is known for its towering gate and surrounding woods. The Imperial Palace sits amid large public gardens. The city's many museums offer exhibits ranging from classical art (in the Tokyo National Museum) to a reconstructed kabuki theater (in the Edo-Tokyo Museum).",
    "highlights": [
      "Shibuya Crossing",
      "Senso-ji Temple",
      "Tokyo Skytree",
      "Meiji Shrine",
      "Akihabara"
    ],
    "quick_fact": "Bustling capital mixing ultramodern neon skyscrapers with historic temples",
    "coordinates": {
      "lat": 35.6762,
      "lng": 139.6503
    },
    "best_season": "March to May, October to November",
    "budget_tier": "mid-range",
    "price_range": {
      "min": 1599,
      "max": 2099
    },
    "estimated_budget": 1599,
    "rating": 4.7,
    "review_count": 2924
  },
  {
    "id": "dest_restore_004",
    "name": "London",
    "slug": "london-uk",
    "country": "United Kingdom",
    "continent": "Europe",
    "image_url": "https://images.unsplash.com/photo-1513635269975-59663e0ac1ad?w=1200&q=80",
    "blog": "## The Historic Capital: London\n\nLondon, the capital of England and the United Kingdom, is a 21st-century city with history stretching back to Roman times. At its centre stand the imposing Houses of Parliament, the iconic 'Big Ben' clock tower and Westminster Abbey, site of British monarch coronations. Across the Thames River, the London Eye observation wheel provides panoramic views of the South Bank cultural complex, and the entire city.",
    "highlights": [
      "Big Ben",
      "Tower of London",
      "British Museum",
      "Buckingham Palace",
      "London Eye"
    ],
    "quick_fact": "Historic capital blending Roman history with modern culture and iconic landmarks",
    "coordinates": {
      "lat": 51.5074,
      "lng": -0.1278
    },
    "best_season": "May to September",
    "budget_tier": "luxury",
    "price_range": {
      "min": 1899,
      "max": 2299
    },
    "estimated_budget": 1899,
    "rating": 4.7,
    "review_count": 2612
  },
  {
    "id": "dest_restore_005",
    "name": "Rome",
    "slug": "rome-italy",
    "country": "Italy",
    "continent": "Europe",
    "image_url": "https://images.unsplash.com/photo-1552832230-c0197dd311b5?w=1200&q=80",
    "blog": "## The Eternal City: Rome\n\nRome, Italy’s capital, is a sprawling, cosmopolitan city with nearly 3,000 years of globally influential art, architecture and culture on display. Ancient ruins such as the Forum and the Colosseum evoke the power of the former Roman Empire. Vatican City, headquarters of the Roman Catholic Church, has St. Peter’s Basilica and the Vatican Museums, which house masterpieces such as Michelangelo’s Sistine Chapel frescoes.",
    "highlights": [
      "Colosseum",
      "Vatican City",
      "Trevi Fountain",
      "Pantheon",
      "Roman Forum"
    ],
    "quick_fact": "The Eternal City showcasing 3,000 years of art, architecture, and culture",
    "coordinates": {
      "lat": 41.9028,
      "lng": 12.4964
    },
    "best_season": "April to June, September to October",
    "budget_tier": "mid-range",
    "price_range": {
      "min": 1699,
      "max": 2199
    },
    "estimated_budget": 1699,
    "rating": 4.6,
    "review_count": 1206
  },
  {
    "id": "dest_restore_006",
    "name": "New York City",
    "slug": "new-york-city-usa",
    "country": "United States",
    "continent": "Americas",
    "image_url": "https://images.unsplash.com/photo-1496442226666-8d4d0e62e6e9?w=1200&q=80",
    "blog": "## The City That Never Sleeps: New York City\n\nNew York City comprises 5 boroughs sitting where the Hudson River meets the Atlantic Ocean. At its core is Manhattan, a densely populated borough that’s among the world’s major commercial, financial and cultural centers. Its iconic sites include skyscrapers such as the Empire State Building and sprawling Central Park. Broadway theater is staged in neon-lit Times Square.",
    "highlights": [
      "Statue of Liberty",
      "Central Park",
      "Times Square",
      "Empire State Building",
      "Broadway"
    ],
    "quick_fact": "Global cultural hub known for its skyline, Broadway, and 24/7 energy",
    "coordinates": {
      "lat": 40.7128,
      "lng": -74.006
    },
    "best_season": "April to June, September to November",
    "budget_tier": "luxury",
    "price_range": {
      "min": 3899,
      "max": 6999
    },
    "estimated_budget": 3899,
    "rating": 4.5,
    "review_count": 2361
  },
  {
    "id": "dest_restore_007",
    "name": "Sydney",
    "slug": "sydney-australia",
    "country": "Australia",
    "continent": "Oceania",
    "image_url": "https://images.unsplash.com/photo-1506973035872-a4ec16b8e8d9?w=1200&q=80",
    "blog": "## The Harbour City: Sydney\n\nSydney, capital of New South Wales and one of Australia's largest cities, is best known for its harbourfront Sydney Opera House, with a distinctive sail-like design. Massive Darling Harbour and the smaller Circular Quay port are hubs of waterside life, with the arched Harbour Bridge and esteemed Royal Botanic Garden nearby. Sydney Tower’s outdoor platform, the Skywalk, offers 360-degree views of the city and suburbs.",
    "highlights": [
      "Sydney Opera House",
      "Bondi Beach",
      "Harbour Bridge",
      "Darling Harbour",
      "Taronga Zoo"
    ],
    "quick_fact": "Vibrant harbour city famous for its Opera House, surf beaches, and sunny lifestyle",
    "coordinates": {
      "lat": -33.8688,
      "lng": 151.2093
    },
    "best_season": "September to November, March to May",
    "budget_tier": "luxury",
    "price_range": {
      "min": 3999,
      "max": 6499
    },
    "estimated_budget": 3999,
    "rating": 4.5,
    "review_count": 2194
  },
  {
    "id": "dest_restore_008",
    "name": "Barcelona",
    "slug": "barcelona-spain",
    "country": "Spain",
    "continent": "Europe",
    "image_url": "https://images.unsplash.com/photo-1583422409516-2895a77efded?w=1200&q=80",
    "blog": "## The Cosmopolitan Capital: Barcelona\n\nBarcelona, the cosmopolitan capital of Spain’s Catalonia region, is known for its art and architecture. The fantastical Sagrada Família church and other modernist landmarks designed by Antoni Gaudí dot the city. Museu Picasso and Fundació Joan Miró feature modern art by their namesakes. City history museum MUHBA, includes several Roman archaeological sites.",
    "highlights": [
      "Sagrada Família",
      "Park Güell",
      "La Rambla",
      "Gothic Quarter",
      "Casa Batlló"
    ],
    "quick_fact": "Vibrant city famed for Gaudí's architecture, beaches, and world-class cuisine",
    "coordinates": {
      "lat": 41.3851,
      "lng": 2.1734
    },
    "best_season": "May to June, September to October",
    "budget_tier": "mid-range",
    "price_range": {
      "min": 1899,
      "max": 2699
    },
    "estimated_budget": 1899,
    "rating": 4.7,
    "review_count": 1074
  },
  {
    "id": "dest_restore_009",
    "name": "Rio de Janeiro",
    "slug": "rio-de-janeiro-brazil",
    "country": "Brazil",
    "continent": "Americas",
    "image_url": "https://images.unsplash.com/photo-1483729558449-99ef09a8c325?w=1200&q=80",
    "blog": "## The Marvelous City: Rio de Janeiro\n\nRio de Janeiro is a huge seaside city in Brazil, famed for its Copacabana and Ipanema beaches, 38m Christ the Redeemer statue atop Mount Corcovado and for Sugarloaf Mountain, a granite peak with cable cars to its summit. The city is also known for its sprawling favelas (shanty towns). Its raucous Carnaval festival, featuring parade floats, flamboyant costumes and samba dancers, is considered the world’s largest.",
    "highlights": [
      "Christ the Redeemer",
      "Copacabana Beach",
      "Sugarloaf Mountain",
      "Ipanema Beach",
      "Tijuca National Park"
    ],
    "quick_fact": "Vibrant city known for samba, beaches, and the iconic Christ the Redeemer statue",
    "coordinates": {
      "lat": -22.9068,
      "lng": -43.1729
    },
    "best_season": "December to March",
    "budget_tier": "mid-range",
    "price_range": {
      "min": 1999,
      "max": 2799
    },
    "estimated_budget": 1999,
    "rating": 4.5,
    "review_count": 2967
  },
  {
    "id": "dest_new_001",
    "name": "Santorini",
    "slug": "santorini-greece",
    "country": "Greece",
    "continent": "Europe",
    "image_url": "https://images.unsplash.com/photo-1613395877344-13d4a8e0d49e?w=1200&q=80",
    "blog": "## The Jewel of the Aegean: Santorini\n\nSantorini is a volcanic island in the Cyclades group of the Greek islands. It was devastated by a volcanic eruption in the 16th century BC, forever shaping its rugged landscape. The whitewashed, cubiform houses of its 2 principal towns, Fira and Oia, cling to cliffs above an underwater caldera (crater). They overlook the sea, small islands to the west and beaches made up of black, red and white lava pebbles.",
    "highlights": [
      "Oia Sunset",
      "Red Beach",
      "Akrotiri Archaeological Site",
      "Wine Tasting",
      "Caldera Views"
    ],
    "quick_fact": "Famous for stunning sunsets, white-washed buildings, and blue-domed churches overlooking the Aegean Sea",
    "coordinates": {
      "lat": 36.3932,
      "lng": 25.4615
    },
    "best_season": "April to November",
    "budget_tier": "luxury",
    "price_range": {
      "min": 2299,
      "max": 3999
    },
    "estimated_budget": 2299,
    "rating": 4.8,
    "review_count": 2890,
    "local_tips": [
      "Book sunset viewing spots in Oia well in advance",
      "Try local wines from volcanic soil vineyards",
      "Visit during shoulder season (April-May, Sept-Oct) for fewer crowds"
    ],
    "description": "Santorini is one of the most romantic and picturesque destinations in the world, known for its dramatic cliffs, stunning sunsets, and iconic blue-domed churches."
  },
  {
    "id": "dest_new_002",
    "name": "Dubai",
    "slug": "dubai-uae",
    "country": "United Arab Emirates",
    "continent": "Asia",
    "image_url": "https://images.unsplash.com/photo-1512453979798-5ea266f8880c?w=1200&q=80",
    "blog": "## The City of Gold: Dubai\n\nDubai is a city and emirate in the United Arab Emirates known for luxury shopping, ultramodern architecture and a lively nightlife scene. Burj Khalifa, an 830m-tall tower, dominates the skyscraper-filled skyline. At its foot lies Dubai Fountain, with jets and lights choreographed to music. On artificial islands just offshore is Atlantis, The Palm, a resort with water and marine-animal parks.",
    "highlights": [
      "Burj Khalifa",
      "Dubai Mall",
      "Palm Jumeirah",
      "Desert Safari",
      "Gold Souk"
    ],
    "quick_fact": "Home to the world's tallest building and largest shopping mall, Dubai is a modern marvel in the desert",
    "coordinates": {
      "lat": 25.2048,
      "lng": 55.2708
    },
    "best_season": "November to March",
    "budget_tier": "luxury",
    "price_range": {
      "min": 2499,
      "max": 4999
    },
    "estimated_budget": 2499,
    "rating": 4.7,
    "review_count": 3210,
    "local_tips": [
      "Dress modestly when visiting mosques and traditional areas",
      "Use the metro for affordable transportation",
      "Book desert safari tours in advance for best prices"
    ],
    "description": "Dubai offers a unique blend of traditional Arabian culture and cutting-edge modernity, with world-class shopping, dining, and entertainment."
  },
  {
    "id": "dest_new_003",
    "name": "Amsterdam",
    "slug": "amsterdam-netherlands",
    "country": "Netherlands",
    "continent": "Europe",
    "image_url": "https://images.unsplash.com/photo-1534351590666-13e3e96b5017?w=1200&q=80",
    "blog": "## The Venice of the North: Amsterdam\n\nAmsterdam is the Netherlands' capital, known for its artistic heritage, elaborate canal system and narrow houses with gabled facades, legacies of the city's 17th-century Golden Age. Its Museum District houses the Van Gogh Museum, works by Rembrandt and Vermeer at the Rijksmuseum, and modern art at the Stedelijk. Cycling is key to the city's character, and there are numerous bike paths.",
    "highlights": [
      "Canal Cruise",
      "Anne Frank House",
      "Van Gogh Museum",
      "Rijksmuseum",
      "Vondelpark"
    ],
    "quick_fact": "Amsterdam has more bicycles than people and over 100 kilometers of canals",
    "coordinates": {
      "lat": 52.3676,
      "lng": 4.9041
    },
    "best_season": "April to May, September to November",
    "budget_tier": "mid-range",
    "price_range": {
      "min": 1799,
      "max": 2899
    },
    "estimated_budget": 1799,
    "rating": 4.6,
    "review_count": 2650,
    "local_tips": [
      "Rent a bike to explore the city like a local",
      "Book museum tickets online to skip long queues",
      "Try stroopwafels and Dutch cheese at local markets"
    ],
    "description": "Amsterdam is a charming city of canals, world-class museums, and vibrant culture, perfect for art lovers and cycling enthusiasts."
  },
  {
    "id": "dest_new_004",
    "name": "Maldives",
    "slug": "maldives",
    "country": "Maldives",
    "continent": "Asia",
    "image_url": "https://images.unsplash.com/photo-1514282401047-d79a71a590e8?w=1200&q=80",
    "blog": "## Paradise on Earth: Maldives\n\nThe Maldives is a tropical nation in the Indian Ocean composed of 26 ring-shaped atolls, which are made up of more than 1,000 coral islands. It's known for its beaches, blue lagoons and extensive reefs. The capital, Malé, has a busy fish market, restaurants and shops on the main road, Majeedhee Magu, and 17th-century Hukuru Miskiy (also known as Friday Mosque) made of carved white coral.",
    "highlights": [
      "Overwater Bungalows",
      "Snorkeling & Diving",
      "Bioluminescent Beaches",
      "Island Hopping",
      "Spa Resorts"
    ],
    "quick_fact": "The Maldives is the world's lowest-lying country with crystal-clear waters and pristine beaches",
    "coordinates": {
      "lat": 3.2028,
      "lng": 73.2207
    },
    "best_season": "November to April",
    "budget_tier": "luxury",
    "price_range": {
      "min": 3499,
      "max": 7999
    },
    "estimated_budget": 3499,
    "rating": 4.9,
    "review_count": 2340,
    "local_tips": [
      "Book all-inclusive resorts for best value",
      "Visit local islands for authentic Maldivian culture",
      "Bring reef-safe sunscreen to protect marine life"
    ],
    "description": "The Maldives offers the ultimate tropical paradise experience with luxurious overwater villas, world-class diving, and pristine beaches."
  },
  {
    "id": "dest_new_005",
    "name": "Iceland",
    "slug": "iceland",
    "country": "Iceland",
    "continent": "Europe",
    "image_url": "https://images.unsplash.com/photo-1504829857797-ddff29c27927?w=1200&q=80",
    "blog": "## Land of Fire and Ice: Iceland\n\nIceland, a Nordic island nation, is defined by its dramatic landscape with volcanoes, geysers, hot springs and lava fields. Massive glaciers are protected in Vatnajökull and Snæfellsjökull national parks. Most of the population lives in the capital, Reykjavik, which runs on geothermal power and is home to the National and Saga museums, tracing Iceland's Viking history.",
    "highlights": [
      "Blue Lagoon",
      "Golden Circle",
      "Northern Lights",
      "Jökulsárlón Glacier Lagoon",
      "Waterfalls"
    ],
    "quick_fact": "Iceland has no mosquitoes and is one of the best places to see the Northern Lights",
    "coordinates": {
      "lat": 64.9631,
      "lng": -19.0208
    },
    "best_season": "June to August (summer), September to March (Northern Lights)",
    "budget_tier": "luxury",
    "price_range": {
      "min": 2799,
      "max": 4999
    },
    "estimated_budget": 2799,
    "rating": 4.8,
    "review_count": 1890,
    "local_tips": [
      "Rent a 4x4 vehicle for exploring the countryside",
      "Try traditional Icelandic hot dogs and skyr",
      "Book Blue Lagoon tickets well in advance"
    ],
    "description": "Iceland offers otherworldly landscapes with glaciers, volcanoes, geysers, and the magical Northern Lights."
  },
  {
    "id": "dest_new_006",
    "name": "Singapore",
    "slug": "singapore",
    "country": "Singapore",
    "continent": "Asia",
    "image_url": "https://images.unsplash.com/photo-1525625293386-3f8f99389edd?w=1200&q=80",
    "blog": "## The Lion City: Singapore\n\nSingapore, an island city-state off southern Malaysia, is a global financial center with a tropical climate and multicultural population. Its colonial core centers on the Padang, a cricket field since the 1830s and now flanked by grand buildings such as City Hall. In Singapore's circa-1820 Chinatown stands the red-and-gold Buddha Tooth Relic Temple, said to house one of Buddha's teeth.",
    "highlights": [
      "Marina Bay Sands",
      "Gardens by the Bay",
      "Sentosa Island",
      "Hawker Centers",
      "Universal Studios"
    ],
    "quick_fact": "Singapore is one of the world's cleanest and safest cities with incredible food culture",
    "coordinates": {
      "lat": 1.3521,
      "lng": 103.8198
    },
    "best_season": "February to April",
    "budget_tier": "mid-range",
    "price_range": {
      "min": 1899,
      "max": 3299
    },
    "estimated_budget": 1899,
    "rating": 4.7,
    "review_count": 2780,
    "local_tips": [
      "Try hawker center food for authentic and affordable meals",
      "Use the efficient MRT system for transportation",
      "Visit during the Great Singapore Sale (June-July) for shopping deals"
    ],
    "description": "Singapore is a vibrant city-state blending modern architecture, lush gardens, diverse cuisine, and rich cultural heritage."
  },
  {
    "id": "dest_new_007",
    "name": "Machu Picchu",
    "slug": "machu-picchu-peru",
    "country": "Peru",
    "continent": "South America",
    "image_url": "https://images.unsplash.com/photo-1587595431973-160d0d94add1?w=1200&q=80",
    "blog": "## The Lost City of the Incas: Machu Picchu\n\nMachu Picchu is an Incan citadel set high in the Andes Mountains in Peru, above the Urubamba River valley. Built in the 15th century and later abandoned, it's renowned for its sophisticated dry-stone walls that fuse huge blocks without the use of mortar, intriguing buildings that play on astronomical alignments and panoramic views. Its exact former use remains a mystery.",
    "highlights": [
      "Inca Citadel",
      "Huayna Picchu Hike",
      "Sun Gate",
      "Sacred Valley",
      "Aguas Calientes"
    ],
    "quick_fact": "Machu Picchu was voted one of the New Seven Wonders of the World in 2007",
    "coordinates": {
      "lat": -13.1631,
      "lng": -72.545
    },
    "best_season": "April to October",
    "budget_tier": "mid-range",
    "price_range": {
      "min": 1699,
      "max": 2899
    },
    "estimated_budget": 1699,
    "rating": 4.9,
    "review_count": 3450,
    "local_tips": [
      "Book entrance tickets months in advance",
      "Acclimatize in Cusco before visiting to avoid altitude sickness",
      "Take the early morning train for fewer crowds"
    ],
    "description": "Machu Picchu is one of the world's most iconic archaeological sites, offering breathtaking views and ancient Incan history."
  },
  {
    "id": "dest_new_008",
    "name": "Venice",
    "slug": "venice-italy",
    "country": "Italy",
    "continent": "Europe",
    "image_url": "https://images.unsplash.com/photo-1523906834658-6e24ef2386f9?w=1200&q=80",
    "blog": "## The Floating City: Venice\n\nVenice, the capital of northern Italy's Veneto region, is built on more than 100 small islands in a lagoon in the Adriatic Sea. It has no roads, just canals – including the Grand Canal thoroughfare – lined with Renaissance and Gothic palaces. The central square, Piazza San Marco, contains St. Mark's Basilica, which is tiled with Byzantine mosaics, and the Campanile bell tower offering views of the city's red roofs.",
    "highlights": [
      "Grand Canal",
      "St. Mark's Basilica",
      "Rialto Bridge",
      "Gondola Rides",
      "Murano Glass"
    ],
    "quick_fact": "Venice is built on 118 islands connected by over 400 bridges",
    "coordinates": {
      "lat": 45.4408,
      "lng": 12.3155
    },
    "best_season": "April to June, September to November",
    "budget_tier": "luxury",
    "price_range": {
      "min": 2199,
      "max": 3999
    },
    "estimated_budget": 2199,
    "rating": 4.7,
    "review_count": 2990,
    "local_tips": [
      "Get lost in the backstreets away from tourist crowds",
      "Try cicchetti (Venetian tapas) at local bacari",
      "Visit early morning or late evening for the best atmosphere"
    ],
    "description": "Venice is a unique floating city of canals, art, and romance, offering unforgettable gondola rides and Renaissance architecture."
  },
  {
    "id": "dest_new_009",
    "name": "Petra",
    "slug": "petra-jordan",
    "country": "Jordan",
    "continent": "Asia",
    "image_url": "https://images.unsplash.com/photo-1578895101408-1a36b834405b?w=1200&q=80",
    "blog": "## The Rose City: Petra\n\nPetra is a famous archaeological site in Jordan's southwestern desert. Dating to around 300 B.C., it was the capital of the Nabatean Kingdom. Accessed via a narrow canyon called Al Siq, it contains tombs and temples carved into pink sandstone cliffs, earning its nickname, the 'Rose City.' Perhaps its most famous structure is 45m-high Al Khazneh, a temple with an ornate, Greek-style facade, and known as The Treasury.",
    "highlights": [
      "The Treasury",
      "Monastery",
      "Siq Canyon",
      "Royal Tombs",
      "High Place of Sacrifice"
    ],
    "quick_fact": "Petra is one of the New Seven Wonders of the World and was featured in Indiana Jones",
    "coordinates": {
      "lat": 30.3285,
      "lng": 35.4444
    },
    "best_season": "March to May, September to November",
    "budget_tier": "mid-range",
    "price_range": {
      "min": 1599,
      "max": 2699
    },
    "estimated_budget": 1599,
    "rating": 4.8,
    "review_count": 2120,
    "local_tips": [
      "Wear comfortable hiking shoes for exploring",
      "Visit early morning to avoid heat and crowds",
      "Consider a 2-day pass to fully explore the site"
    ],
    "description": "Petra is an ancient city carved into rose-red cliffs, offering one of the world's most spectacular archaeological experiences."
  },
  {
    "id": "dest_new_010",
    "name": "Bora Bora",
    "slug": "bora-bora-french-polynesia",
    "country": "French Polynesia",
    "continent": "Oceania",
    "image_url": "https://images.unsplash.com/photo-1589197331516-e4d9e6d0e8e6?w=1200&q=80",
    "blog": "## The Pearl of the Pacific: Bora Bora\n\nBora Bora is a small South Pacific island northwest of Tahiti in French Polynesia. Surrounded by sand-fringed motus (islets) and a turquoise lagoon protected by a coral reef, it's known for its scuba diving. It's also a popular luxury resort destination where some guest bungalows are perched over the water on stilts. At the island's center rises Mt. Otemanu, a 727m dormant volcano.",
    "highlights": [
      "Overwater Bungalows",
      "Lagoon Tours",
      "Mount Otemanu",
      "Coral Gardens",
      "Matira Beach"
    ],
    "quick_fact": "Bora Bora's lagoon is one of the most beautiful in the world with stunning turquoise waters",
    "coordinates": {
      "lat": -16.5004,
      "lng": -151.7415
    },
    "best_season": "May to October",
    "budget_tier": "luxury",
    "price_range": {
      "min": 4999,
      "max": 9999
    },
    "estimated_budget": 4999,
    "rating": 4.9,
    "review_count": 1680,
    "local_tips": [
      "Book overwater bungalows well in advance",
      "Try poisson cru (Tahitian ceviche)",
      "Take a lagoon tour to see manta rays and sharks"
    ],
    "description": "Bora Bora is the ultimate luxury tropical paradise with crystal-clear lagoons, overwater villas, and world-class resorts."
  },
  {
    "id": "dest_new_011",
    "name": "Edinburgh",
    "slug": "edinburgh-scotland",
    "country": "United Kingdom",
    "continent": "Europe",
    "image_url": "https://images.unsplash.com/photo-1555881400-74d7acaacd8b?w=1200&q=80",
    "blog": "## The Athens of the North: Edinburgh\n\nEdinburgh is Scotland's compact, hilly capital. It has a medieval Old Town and elegant Georgian New Town with gardens and neoclassical buildings. Looming over the city is Edinburgh Castle, home to Scotland's crown jewels and the Stone of Destiny, used in the coronation of Scottish rulers. Arthur's Seat is an imposing peak in Holyrood Park with sweeping views, and Calton Hill is topped with monuments and memorials.",
    "highlights": [
      "Edinburgh Castle",
      "Royal Mile",
      "Arthur's Seat",
      "Holyrood Palace",
      "Edinburgh Festival"
    ],
    "quick_fact": "Edinburgh hosts the world's largest arts festival every August",
    "coordinates": {
      "lat": 55.9533,
      "lng": -3.1883
    },
    "best_season": "May to September",
    "budget_tier": "mid-range",
    "price_range": {
      "min": 1699,
      "max": 2799
    },
    "estimated_budget": 1699,
    "rating": 4.6,
    "review_count": 2450,
    "local_tips": [
      "Book accommodation early if visiting during the Festival in August",
      "Climb Arthur's Seat for panoramic city views",
      "Try haggis and Scottish whisky at traditional pubs"
    ],
    "description": "Edinburgh is a historic and cultural gem with medieval architecture, stunning castles, and vibrant festivals."
  }
]